app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "本日も晴天なり"], ["text", "テスト"], ["created_at", "2020-08-09 07:56:32.155046"], ["updated_at", "2020-08-09 07:56:32.155046"]]
UPDATE "posts" SET "updated_at" = $1 WHERE "posts"."id" = $2  [["updated_at", "2020-08-09 07:56:32.158064"], ["id", 4]]
---
  def create
    @post = Post.create(post_params)
    if @post.save